index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 to. 15:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JSON-LD Contexts</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Martin G. Skjæveland" />
</head>
<body>
<div id="content">
<h1 class="title">JSON-LD Contexts
<br />
<span class="subtitle">Useful JSON-LD contexts!</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org84a0bbe">1. JSON-LD Contexts</a>
<ul>
<li><a href="#orgb2ce4d5">1.1. Script</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org84a0bbe" class="outline-2">
<h2 id="org84a0bbe"><span class="section-number-2">1</span> JSON-LD Contexts</h2>
<div class="outline-text-2" id="text-1">
<p>
Helpful JSON-LD contexts!
</p>

<table id="orgbc77bf4" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">link</th>
<th scope="col" class="org-left">prefix</th>
<th scope="col" class="org-left">namespace</th>
<th scope="col" class="org-left">source</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="./rdfs.json">./rdfs.json</a></td>
<td class="org-left">rdfs</td>
<td class="org-left"><a href="http://www.w3.org/2000/01/rdf-schema">http://www.w3.org/2000/01/rdf-schema</a>#</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="./owl.json">./owl.json</a></td>
<td class="org-left">owl</td>
<td class="org-left"><a href="http://www.w3.org/2002/07/owl">http://www.w3.org/2002/07/owl</a>#</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="./skos.json">./skos.json</a></td>
<td class="org-left">skos</td>
<td class="org-left"><a href="http://www.w3.org/2004/02/skos/core">http://www.w3.org/2004/02/skos/core</a>#</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="./sh.json">./sh.json</a></td>
<td class="org-left">sh</td>
<td class="org-left"><a href="http://www.w3.org/ns/shacl">http://www.w3.org/ns/shacl</a>#</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><a href="./foaf.json">./foaf.json</a></td>
<td class="org-left">foaf</td>
<td class="org-left"><a href="http://xmlns.com/foaf/0.1/">http://xmlns.com/foaf/0.1/</a></td>
<td class="org-left"><a href="http://xmlns.com/foaf/0.1/index.rdf">http://xmlns.com/foaf/0.1/index.rdf</a></td>
</tr>

<tr>
<td class="org-left"><a href="./pav.json">./pav.json</a></td>
<td class="org-left">pav</td>
<td class="org-left"><a href="http://purl.org/pav/">http://purl.org/pav/</a></td>
<td class="org-left"><a href="http://pav-ontology.github.io/pav/pav.rdf">http://pav-ontology.github.io/pav/pav.rdf</a></td>
</tr>

<tr>
<td class="org-left"><a href="./dc.json">./dc.json</a></td>
<td class="org-left">dc</td>
<td class="org-left"><a href="http://purl.org/dc/elements/1.1/">http://purl.org/dc/elements/1.1/</a></td>
<td class="org-left"><a href="https://www.dublincore.org/specifications/dublin-core/dcmi-terms/dublin_core_terms.ttl">https://www.dublincore.org/specifications/dublin-core/dcmi-terms/dublin_core_terms.ttl</a></td>
</tr>

<tr>
<td class="org-left"><a href="./vann.json">./vann.json</a></td>
<td class="org-left">vann</td>
<td class="org-left"><a href="http://purl.org/vocab/vann/">http://purl.org/vocab/vann/</a></td>
<td class="org-left"><a href="https://vocab.org/vann/vann-vocab-20100607.rdf">https://vocab.org/vann/vann-vocab-20100607.rdf</a></td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-orgb2ce4d5" class="outline-3">
<h3 id="orgb2ce4d5"><span class="section-number-3">1.1</span> Script</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Insprired by <a href="https://gist.github.com/niklasl/2770154">https://gist.github.com/niklasl/2770154</a>
</p>

<div class="org-src-container">
<pre class="src src-python">import sys
import rdflib
import json
from rdflib import Graph, Namespace, URIRef
from rdflib.namespace import NamespaceManager, XSD, RDF, RDFS, OWL

output = ""

for row in table:

  prefix = str(row[1]).strip()
  url = str(row[2]).strip()
  source = str(row[3]).strip()
  if(source == ''):
    source = url

  g = Graph().parse(source)
  nm = NamespaceManager(g)
  
  # TODO read imports too?
  
  stdObjectRanges = { RDF.Property, RDFS.Class, RDFS.Datatype, OWL.Class, OWL.Thing, OWL.Ontology }
  stdDataRanges = { RDFS.Literal }
  
  # collect classes and properties
  classes = set(g.subjects(RDF.type, OWL.Class)) | set(g.subjects(RDF.type, RDFS.Class))
  objectProperties = set(g.subjects(RDF.type, OWL.ObjectProperty))
  dataProperties = set(g.subjects(RDF.type, OWL.DatatypeProperty))
  otherProperties = set(g.subjects(RDF.type, RDF.Property)) | set(g.subjects(RDF.type, OWL.AnnotationProperty))
  
  # decide if other Properties are object or data properties:
  for p in set(g.subjects(RDF.type, RDF.Property)) - (objectProperties | dataProperties):
      if (set(g.objects(p, RDFS.range)) &amp; (classes | stdObjectRanges)) - stdDataRanges:
          objectProperties.add(p)
      elif filter(lambda p : p.startswith(XSD), set(g.objects(p, RDFS.range))) or set(g.objects(p, RDFS.range)) &amp; stdDataRanges:
          dataProperties.add(p)
  
  ####
  
  context = list()
  context.append('"@version": 1.1')
  
  # Prefixes
  prefixes = list(map(lambda p : '"' + p[0] + '": "' + str(p[1]) + '"', sorted(NamespaceManager(g).namespaces())))
  context.extend(prefixes)
  
  # Imports?
  
  # Properties
  properties = list()
  for p in sorted(objectProperties | dataProperties | otherProperties):
      attributes = list()
  
      if p in objectProperties:
          attributes.append('"@type": "@id"')
  
      if p in dataProperties:
          ranges = set(g.objects(p, RDFS.range)) - { RDFS.Literal }
          xsdranges = set(filter(lambda p : p.startswith(XSD), ranges))
          if len(ranges) == len(xsdranges) == 1:
              attributes.append('"@type": "%s"' % (nm.qname(xsdranges.pop())))
  
      if (p, RDFS.range, RDF.List) in g:
          attributes.append('"@container": "@list"')
  
      properties.append('"' + nm.qname(p) + '": {' + ', '.join(attributes) + '}')
  context.extend(properties)
  
  
  # print
  jsonString = '{ "@context": {' + ','.join(context) + ' } }' # end context and file
  print(json.dumps(json.loads(jsonString), indent=2))

  filename = prefix + ".json"
  f = open(filename, "w")
  f.write(json.dumps(json.loads(jsonString), indent=2))
  f.close()
</pre>
</div>

None
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Martin G. Skjæveland</p>
<p class="date">Created: 2023-08-17 to. 15:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
